I have this exact same issue.
Using terraform: 1.3.4
AWS Provider: 4.38.0

Example - providers.tf
```
provider "aws" {
  region  = "us-east-1"
}
```

Example - main.tf
```
resource "aws_cognito_user_pool" "my_pool" {
  name = "my-test-user-pool"
}

resource "aws_cognito_user_pool_client" "my_pool_client" {
  name                    = "test-test-user-pool-client"
  user_pool_id            = aws_cognito_user_pool.my_pool.id
  enable_token_revocation = false
}
```

On plan, I can see the enable_token_revocation says it's set to false:
```
 # aws_cognito_user_pool_client.my_pool_client will be created
  + resource "aws_cognito_user_pool_client" "my_pool_client" {
      + auth_session_validity         = 3
      + callback_urls                 = (known after apply)
      + client_secret                 = (sensitive value)
      + enable_token_revocation       = false
      + id                            = (known after apply)
      + logout_urls                   = (known after apply)
      + name                          = "test-test-user-pool-client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
    }
```

However, if I then inspect the user pool client, I can see token revocation is still set to true:
```
wsealock:~$ aws cognito-idp describe-user-pool-client --user-pool-id us-east-1_6syQJkFiJ --client-id 4qo1saqdnb8ev46uh90iv8t7tk
{
    "UserPoolClient": {
        "UserPoolId": "us-east-1_6syQJkFiJ",
        "ClientName": "test-test-user-pool-client",
        "ClientId": "4qo1saqdnb8ev46uh90iv8t7tk",
        "LastModifiedDate": "2022-11-07T11:24:13.582000-07:00",
        "CreationDate": "2022-11-07T11:24:13.582000-07:00",
        "RefreshTokenValidity": 30,
        "TokenValidityUnits": {},
        "AllowedOAuthFlowsUserPoolClient": false,
        "EnableTokenRevocation": true
    }
}
```

If I do another plan (with no config changes), it shows this as a difference:
```
Terraform will perform the following actions:

  # aws_cognito_user_pool_client.my_pool_client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "my_pool_client" {
      ~ enable_token_revocation                       = true -> false
        id                                            = "50d4g7gam92o7r3ng5abugkkon"
        name                                          = "test-test-user-pool-client"
        # (15 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

If I then do an apply, then EnabletokenRevocation is set as expected:
```
wsealock:~$ aws cognito-idp describe-user-pool-client --user-pool-id us-east-1_6syQJkFiJ --client-id 4qo1saqdnb8ev46uh90iv8t7tk
{
    "UserPoolClient": {
        "UserPoolId": "us-east-1_6syQJkFiJ",
        "ClientName": "test-test-user-pool-client",
        "ClientId": "4qo1saqdnb8ev46uh90iv8t7tk",
        "LastModifiedDate": "2022-11-07T11:39:33.389000-07:00",
        "CreationDate": "2022-11-07T11:24:13.582000-07:00",
        "RefreshTokenValidity": 30,
        "TokenValidityUnits": {},
        "AllowedOAuthFlowsUserPoolClient": false,
        "EnableTokenRevocation": false
    }
}
```

Other than doing plan, apply, plan, apply, I haven't found any acceptable workaround.
